/* global use, db */
// MongoDB Playground
// Use Ctrl+Space inside a snippet or a string literal to trigger completions.

const database = 'mongodbVSCodePlaygroundDB';
//const collection = 'antikeimeno';

// The current database to use.
use(database);

// Create a new collection.
//db.createCollection(collection);
db.createCollection("ΑΝΤΙΚΕΙΜΕΝΟ");
db.createCollection("ΙΔΙΟΤΗΤΑ");
db.createCollection("ΑΠΑΝΤΗΣΗ");

db.ΑΝΤΙΚΕΙΜΕΝΟ.insertMany([
  { _id: "ΓΑΤΑ" },
  { _id: "ΚΑΠΕΛΟ" },
  { _id: "ΔΡΕΠΑΝΙ" },
  { _id: "ΜΠΟΤΕΣ" },
  { _id: "ΕΛΙΞΙΡΙΟ" },
  { _id: "ΒΙΒΛΙΟ" },
  { _id: "ΠΟΤΗΣΤΗΡΙ" }
]);

db.ΙΔΙΟΤΗΤΑ.insertMany([
  { _id: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;" },
  { _id: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;" },
  { _id: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;" },
  { _id: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;" },
  { _id: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;" },
  { _id: "Θα το έβρισκες σε έναν κήπο;" },
  { _id: "Έχει φτερά;" },
  { _id: "Μπορεί να συνδεθεί με τη φύση ή το νερό;" }
]);


db.ΑΠΑΝΤΗΣΗ.insertMany([
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "NO" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "YES" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "NO" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "NO" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "YES" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "YES" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Έχει φτερά;", απάντηση: "YES" },
  { αντικείμενο: "ΓΑΤΑ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "YES" },

  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "YES" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "YES" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "YES" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "YES" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "NO" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "NO" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Έχει φτερά;", απάντηση: "YES" },
  { αντικείμενο: "ΚΑΠΕΛΟ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "NO" },

  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "NO" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "NO" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "NO" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "NO" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "YES" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "NO" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Έχει φτερά;", απάντηση: "NO" },
  { αντικείμενο: "ΔΡΕΠΑΝΙ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "NO" },

  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "NO" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "YES" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "NO" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "NO" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "NO" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "YES" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Έχει φτερά;", απάντηση: "NO" },
  { αντικείμενο: "ΜΠΟΤΕΣ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "YES" },

  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "YES" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "NO" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "YES" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "YES" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "YES" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "NO" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Έχει φτερά;", απάντηση: "NO" },
  { αντικείμενο: "ΕΛΙΞΙΡΙΟ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "NO" },

  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "YES" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "NO" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "YES" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "YES" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "YES" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "NO" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Έχει φτερά;", απάντηση: "NO" },
  { αντικείμενο: "ΒΙΒΛΙΟ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "NO" },

  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Είναι κάτι που ένας μάγος θα ήθελε να έχει μαζί του;", απάντηση: "NO" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Έχει πάνω του στολίδια ή πολύτιμους λίθους;", απάντηση: "YES" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Μπορεί να θεωρηθεί “μαγικό αντικείμενο”;", απάντηση: "YES" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Μπορεί να χρησιμοποιηθεί για κάποιο “τελετουργικό”;", απάντηση: "NO" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Αν το χρησιμοποιήσεις λάθος, μπορεί να γίνει επικίνδυνο;", απάντηση: "NO" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Θα το έβρισκες σε έναν κήπο;", απάντηση: "YES" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Έχει φτερά;", απάντηση: "YES" },
  { αντικείμενο: "ΠΟΤΗΣΤΗΡΙ", ιδιότητα: "Μπορεί να συνδεθεί με τη φύση ή το νερό;", απάντηση: "YES" }
]);

const app = express();
app.use(cors());
app.use(express.json());

// MongoDB connection
mongoose.connect('mongodb://localhost:27017/leaderboard', { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => console.log('MongoDB connected'))
    .catch(err => console.error(err));


/*
db.ΑΠΑΝΤΗΣΗ.countDocuments();
db.ΑΝΤΙΚΕΙΜΕΝΟ.countDocuments();
db.ΙΔΙΟΤΗΤΑ.countDocuments();
// The prototype form to create a collection:
db.createCollection( <name>,
  {
    capped: <boolean>,
    autoIndexId: <boolean>,
    size: <number>,
    max: <number>,
    storageEngine: <document>,
    validator: <document>,
    validationLevel: <string>,
    validationAction: <string>,
    indexOptionDefaults: <document>,
    viewOn: <string>,
    pipeline: <pipeline>,
    collation: <document>,
    writeConcern: <document>,
    timeseries: { // Added in MongoDB 5.0
      timeField: <string>, // required for time series collections
      metaField: <string>,
      granularity: <string>,
      bucketMaxSpanSeconds: <number>, // Added in MongoDB 6.3
      bucketRoundingSeconds: <number>, // Added in MongoDB 6.3
    },
    expireAfterSeconds: <number>,
    clusteredIndex: <document>, // Added in MongoDB 5.3
  }
)*/

// More information on the `createCollection` command can be found at:
// https://www.mongodb.com/docs/manual/reference/method/db.createCollection/
